---

# Subset Rows

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan], 
        "b" : [7, 8, np.nan, 9, 9], 
        "c" : [10, 11, 12, np.nan, 12]},    
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3),('e',4)], 
        names=['n','v']))
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [3]:
df[df.a < 7]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN

In [4]:
df[df.b > 7]

       a    b     c
n v
d 2  5.0  8.0  11.0
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [5]:
df.b > 7

n  v
d  1    False
   2     True
e  2    False
   3     True
   4     True
Name: b, dtype: bool

In [6]:
df[df['c'] > 7] # 아래와 같은 뜻이다 : c컬럼 중 7보다 큰 값

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  4  NaN  9.0  12.0

In [7]:
df[df.c > 7]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  4  NaN  9.0  12.0

In [8]:
df.drop_duplicates(inplace=True) # 중복된 행 전체 제거하기

In [9]:
df.drop_duplicates?

In [10]:
df = df.drop_duplicates() # pandas에서 inplace는 잘 사용하지 않는다 따라서 df 값을 변경하는 것을 통해 코딩하자
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [11]:
df.head()

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [12]:
df['a'] != 7

n  v
d  1    True
   2    True
e  2    True
   3    True
   4    True
Name: a, dtype: bool

In [13]:
df[df['b'] != 7]

       a    b     c
n v
d 2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [14]:
df.a.isin([5, 6]) # a 컬럼값 중 5와 6이 있는가? * 중요 : list 형태로 input 해주어야 함

n  v
d  1    False
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

In [15]:
df['a'].isin([5, 6]) # 위와 같다 : 한글 등 특정 값이 들어가서 오류가 날 경우 사용

n  v
d  1    False
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

In [16]:
pd.isnull(df) # null 값이 있는지 확인

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  4   True  False  False

In [18]:
df['a'].isnull() # null 값이 있는지 확인

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [20]:
df['a'].isnull().sum() # null 값 개수 확인

1

In [21]:
df['a'].notnull() # null 값이 아닌 것

n  v
d  1     True
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

In [22]:
df.notnull().sum()

a    4
b    4
c    4
dtype: int64

In [23]:
df.a.notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

- &,    |,   ~,   ^, df.any(),  df.all()
- and, or, not, xor,      any,  all

In [24]:
df.all()

a    True
b    True
c    True
dtype: bool

In [25]:
~df.a.notnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [26]:
df[df.b == 7] | df[df.a == 5]

      a   b   c
n v
d 1 NaN NaN NaN
  2 NaN NaN NaN

In [28]:
df.head(2)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [29]:
df.tail(2)

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [33]:
df.sample(2)

       a    b     c
n v
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN

In [35]:
df.iloc[1:4] # 1부터 4 전까지, 즉 3행까지 출력

       a    b     c
n v
d 2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN

In [36]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [38]:
df.nlargest(3, 'c') # c열에서 가장 큰 값을 n번째까지 구하기

       a    b     c
n v
e 2  6.0  NaN  12.0
  4  NaN  9.0  12.0
d 2  5.0  8.0  11.0

In [39]:
df.nsmallest(2, 'b') # b열에서 가장 큰 값을 2번째까지 구하기

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0